app/views/spin/index.html.erb

SELECT "proteins".* FROM "proteins"
SELECT "seasonings".* FROM "seasonings"
---
  {
    "protein": <%= @proteins.map { |p| p.name }.to_json %>
  , "veggies": <%= @veggies.map { |p| p.name }.to_json %>
  , "seasonings": <%= @seasonings.map { |p| p.name }.to_json %>