app/controllers/spin_controller.rb

  def index
    @proteins = Protein.all
    @veggies = Vegetable.all
    @seasonings = Seasoning.all
---
SELECT "proteins".* FROM "proteins"
SELECT "vegetables".* FROM "vegetables"
SELECT "seasonings".* FROM "seasonings"